tutorials/FENE-CR/constant/viscoelasticProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viscoelasticProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type FENE-CR;
rho              [1 -3 0 0 0 0 0] 875.96;
etaS             [1 -1 -1 0 0 0 0] 0.007;
etaP             [1 -1 -1 0 0 0 0] 11.356;
lambda           [0 0 1 0 0 0 0] 0.35;
L2               [0 0 0 0 0 0 0] 25;


// ************************************************************************* //
